import { useEffect } from "react";
import { useLocation } from "react-router-dom";

export const useScrollTop = () => {
  const { pathname } = useLocation(); // pathname을 객체로 반환시켜줌

  //내가 지금 페이지를 변경했는지 안했는지 파악시켜주기 위한것
  // Url로 파악가능
  useEffect(() => {
    window.scrollTo({
      top: 0,
      left: 0,
      behavior: "smooth",
    }); // 그림 그리기전에 작동할 것들을 여기에 작성 , 즉 값이 변경될때 이 함수가 실행되게끔 한다는 것임
    // 무한스크롤에서 이 부분이 중요함 -> 경로가 바뀔때만 0 ,0 으로 해야지 무한스크롤 나올때마다 0,0나오면 안되니까
  }, [pathname]);
  // 네모나 도화지 Document가 먼저 완성되고
  // 디자인이 그려질 건데
  // 그리기 전에 연필과 붓을 가져와야겟죠?
  // 다시 찾으러 가야돼 - > 그럴바에야 세팅을 미리 해주는것 = 렌더링이 되는것
  // 렌더링, 마운팅이 되었다 = 그림이 다 그려졌다
  // 이후 가만히 놔두나? 연필이랑 붓을 정리해야함 -> 그래서 이걸 정리하는 작업 = useEffect가 가능

  // ex) 산과 해를 그릴려고하는데, 그라데이션작업에 빨간, 노란색을 그려야함
  // 이건 바꿔치기를 해야함 -> 다시 해를 그려야하나? 그냥 색만 바꿔치기 하면 되는거자나
  // 그래서 중간에 바꿔주는 것 = useEffect가 가능

  // 즉 useEffect는 전 중간 후에 들어가서 작업을 할 수 있게 해줌

  // 페이지 만 바뀌면 위로 올려주고자 하기위함
  // 우리는 pathname이 변경되면 이 함수를 적용하고 싶어함
  // []안에 값이 변경될 떄마다 이 함수값이 실행되는 것임

  return;
};
